Tekla Open API Reference for Tekla Structures 2025
Load.FatherId Property
 The identifier of the father object that the load is attached to.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Identifier FatherId { get; set; }
Public Property FatherId As Identifier
	Get
	Set
Property Value
Type: Identifier
See Also
Reference
Load Class
Tekla.Structures.Model Namespace